
* DONE Creating Development Process doc 
  CLOCK: [2009-12-24 Thu 02:18]--[2009-12-24 Thu 02:23] =>  0:05
* DONE Working on Playing Game Package Diagram
  :CLOCK:
  CLOCK: [2009-12-25 Fri 12:45]--[2009-12-25 Fri 14:31] =>  1:46
  CLOCK: [2009-12-24 Thu 02:25]--[2009-12-24 Thu 02:45] =>  0:20
  :END:

* DONE Working on adding game bullets
  :CLOCK:
  CLOCK: [2010-01-02 Sat 22:14]--[2010-01-02 Sat 22:31] =>  0:17
  CLOCK: [2010-01-02 Sat 19:22]--[2010-01-02 Sat 20:13] =>  0:51
  :END:

* DONE Making the game horizontal rather than vertical
  :CLOCK:    [2010-01-02 Sat 22:33]--[2010-01-02 Sat 22:51] =>  0:18
* DONE creating WarpEnergy class
  CLOCK: [2010-01-02 Sat 23:11]--[2010-01-02 Sat 23:23] =>  0:12

* DONE creating the warp circle
  CLOCK: [2010-01-03 Sun 23:25]--[2010-01-04 Mon 01:19] =>  1:54
* DONE is out of warp energy
  CLOCK: [2010-01-04 Mon 01:53]--[2010-01-04 Mon 01:58] =>  0:05

* DONE making a state where the player is completely warped out so they can warp anywhere on the screen
  CLOCK: [2010-01-07 Thu 01:31]--[2010-01-07 Thu 02:07] =>  0:36
* DONE if player enters shoot space, warp player out
  :CLOCK:
  CLOCK: [2010-01-09 Sat 19:47]--[2010-01-09 Sat 20:03] =>  0:16
  CLOCK: [2010-01-09 Sat 19:33]--[2010-01-09 Sat 19:43] =>  0:10
  :END:
* DONE do not allow warp in to shoot space
  CLOCK: [2010-01-09 Sat 19:43]--[2010-01-09 Sat 19:47] =>  0:04
* DONE create a sprite for the warp out, then scale the sprite in proportion to the energy
  :CLOCK:
  CLOCK: [2010-01-09 Sat 01:20]--[2010-01-09 Sat 02:09] =>  0:49
  CLOCK: [2010-01-08 Fri 23:45]--[2010-01-09 Sat 01:04] =>  1:19
  :END:
** need to fix player grab on initial warp in
   CLOCK: [2010-01-09 Sat 17:54]--[2010-01-09 Sat 18:08] =>  0:14
* TODO create a scrolling background 
  CLOCK: [2010-01-09 Sat 01:08]--[2010-01-09 Sat 01:20] =>  0:12
* DONE create a meter to display the energy, maybe just a line for now
  CLOCK: [2010-01-07 Thu 02:20]--[2010-01-07 Thu 02:48] =>  0:28
* DONE go back and documentation - make sure to document all functions that return retained object
  CLOCK: [2010-01-10 Sun 18:21]--[2010-01-10 Sun 19:21] =>  1:00
* TODO go back and create tests
  CLOCK: [2010-01-10 Sun 23:44]--[2010-01-10 Sun 23:54] =>  0:10
* DONE go back and check memory management
  CLOCK: [2010-01-10 Sun 20:53]--[2010-01-10 Sun 21:01] =>  0:08
* TODO i think there needs to be a penalty for warping out
* DONE make the warp circle touch area more cirle like
  CLOCK: [2010-01-11 Mon 00:50]--[2010-01-11 Mon 01:17] =>  0:27


* add key so no longer need to type password to checkin
